[
  {
    "j_no": 1,
    "name": "Belzabar Software Design India Pvt. Ltd.",
    "position": "Software Engineer",
    "time_period": "Feb 2025 - Present",
    "location": "Delhi, India",
    "description": [
      "Built and extended no-code/low-code workflows using React.js for custom UI components and business logic.",
      "Integrated RESTful APIs and managed client-side data flows for production-ready features.",
      "Collaborated with cross-functional teams to deliver scalable and maintainable frontend solutions."
    ]
  },
  {
    "j_no": 2,
    "name": "Escapekar",
    "position": "React Developer",
    "time_period": "Dec 2024 - Mar 2025",
    "location": "Gurugram, India",
    "description": [
      "Developed AI-powered itinerary planning features to enhance user engagement.",
      "Optimized frontend performance, improving load and render times by over 30%.",
      "Managed asynchronous state and side effects using Redux Saga.",
      "Integrated third-party APIs to enhance application functionality."
    ]
  },
  {
    "j_no": 3,
    "name": "Mintworxs",
    "position": "React Native Developer",
    "time_period": "Aug 2023 - Sept 2024",
    "location": "Noida, India",
    "description": [
      "Built and maintained a POS mobile application using React Native, TypeScript, and MobX.",
      "Developed reusable and responsive UI components to improve scalability.",
      "Integrated APIs for real-time data handling and external service communication.",
      "Used Jira and Bitbucket for project tracking, version control, and team collaboration."
    ]
  },
  {
    "j_no": 4,
    "name": "ChatBucks",
    "position": "React Native Developer",
    "time_period": "Apr 2023 - Aug 2023",
    "location": "Delhi, India",
    "description": [
      "Built mobile app UI components using React Native.",
      "Fixed bugs, improved code quality, and implemented API integrations.",
      "Worked in an agile team environment with regular collaboration and communication."
    ]
  }
]
